#Область ПрограммныйИнтерфейс

// Отправляет уведомления в телеграм
Процедура ОтправитьУведомленияВТелеграмм() Экспорт
    
    Токен = Константы.ВКМ_ТокенУправленияТБотом.Получить();
    
    Если Не ЗначениеЗаполнено(Токен) Тогда
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Отправка сообщения в телеграм. Сообщение не отправлено.",
            УровеньЖурналаРегистрации.Ошибка,,,
            "Токен для Телеграм не установлен.");
        Возврат;
    КонецЕсли;
    
    ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыОповещения.Получить();
    
    Если Не ЗначениеЗаполнено(ИдентификаторЧата) Тогда
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Отправка сообщения в телеграм. Сообщение не отправлено.",
            УровеньЖурналаРегистрации.Ошибка,,,
            "Идентификатор чата для Телеграм не установлен.");
        Возврат;
    КонецЕсли;
    
    Выборка = ПолучитьУведомленияДляОтправки();
        
    Пока Выборка.Следующий() Цикл
        
        Ответ = ОтправитьСообщениеВТелеграмм(Выборка.ТекстСообщения, Токен, ИдентификаторЧата);
        Если Ответ = Неопределено Тогда
            Продолжить;  
        КонецЕсли; 
        
        Если Ответ.КодСостояния = 200 Тогда
            УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();  
            УведомлениеОбъект.Удалить();
        Иначе
            ОписаниеОшибки = Ответ.ПолучитьТелоКакСтроку();  
            ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
                "Отправка сообщений в телеграм. Сообщение не отправлено.",
                УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

// Устанавливает настройки интеграции с телеграм 
Процедура УстановитьНастройкиТелеграм() Экспорт
    Константы.ВКМ_ИдентификаторГруппыОповещения.Установить("-1004388595371");
    Константы.ВКМ_ТокенУправленияТБотом.Установить("7641550529:AAE4njVeVS1DdQ_SB4qQ8x7Gykwnu7jNwYI");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтправитьСообщениеВТелеграмм(Знач ТекстСообщения, Знач Токен, Знач ИдентификаторЧата)
    
    Ответ = Неопределено;
    
    Попытка 
        Соединение = Новый HTTPСоединение(
            "api.telegram.org",,,,,,
            ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
        
        ДанныеСообщения = Новый Структура;
        ДанныеСообщения.Вставить("chat_id", ИдентификаторЧата);
        ДанныеСообщения.Вставить("text", ТекстСообщения);
        
        ЗаписьJSON = Новый ЗаписьJSON;
        ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, ДанныеСообщения);
        СообщениеДляОтправки = ЗаписьJSON.Закрыть();
        
        Заголовки = Новый Соответствие;
        Заголовки.Вставить("content-type", "application/json");
        
        АдресURL = СтрШаблон("/bot%1/sendMessage", Токен);
        HTTPЗапрос = Новый HTTPЗапрос(АдресURL, Заголовки);
        HTTPЗапрос.УстановитьТелоИзСтроки(СообщениеДляОтправки);
        Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
        
    Исключение
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Отправка сообщения в телеграм. Непредвиденная ошибка.",
            УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());        
        Возврат Неопределено;
    КонецПопытки;
    
    Возврат Ответ;
    
КонецФункции

Функция ПолучитьУведомленияДляОтправки()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
    |   ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
    |ИЗ
    |   Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
    
    Возврат Запрос.Выполнить().Выбрать();
    
КонецФункции

#КонецОбласти