#language: ru

@tree

Функционал: Специалист берет в работу Обслуживание абонентов и закрывает заявку

Как Специалист я хочу
взять в работу документ Обслуживание абонентов и выполнить заявку
чтобы проверить работоспособность функционала   

Контекст:
	Дано я подключаю TestClient "Фирма IT" логин "Специалист" пароль ""
	И я закрываю все окна клиентского приложения

Сценарий: закрытие документа Обслуживание клиента специалисты Иванов и Зайсанова
	* Закрытие документа Обслуживание клиентов выполненными работами специалиста Иванов 
		И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
		Тогда открылось окно "Обслуживание клиентов"
		И в таблице 'Список' я перехожу к строке:
			| "Время начала работ (План)" | "Время окончания работ (План)" | "Дата"                | "Дата проведения работ" | "Договор"                      | "Клиент"                                  | "Номер"     | "Специалист"  | "Ссылка"                                                | "Статус заявки"              |
			| "09.00"                     | "15.00"                        | "24.09.2026 18:02:00" | "29.09.2026"            | "Обслуживание абонентов №1004" | "ООО Кусочек счастья для бездомной кошки" | "000000014" | "Иванов И.И." | "Обслуживание клиента 000000014 от 24.09.2026 18:02:00" | "Ожидается выполнение работ" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Обслуживание клиента * от *"
	* Заполнение табличной части
		И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
		И в таблице 'ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВыполненныеРаботыПредоставленнаяУслуга'
		Тогда открылось окно "Номенклатура"
		И в таблице 'Список' я перехожу на один уровень вниз
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"             |
			| "000000001" | "Диагностика оборудования" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Обслуживание клиента * от * *"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
		И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
		И в таблице 'ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВыполненныеРаботыПредоставленнаяУслуга'
		Тогда открылось окно "Номенклатура"
		И в таблице 'Список' я перехожу на один уровень вниз
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"         |
			| "000000007" | "Замена комплектующих" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Обслуживание клиента * от * *"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
		И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
		И в таблице 'ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВыполненныеРаботыПредоставленнаяУслуга'
		Тогда открылось окно "Номенклатура"
		И в таблице 'Список' я перехожу на один уровень вниз
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"        |
			| "000000006" | "Ремонт оборудования" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Обслуживание клиента * от * *"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
		И в таблице 'ВыполненныеРаботы' я перехожу к строке:
			| "N" | "Описание выполненных работ" |
			| "1" | "Диагностика оборудования"   |
		И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов'
		И в таблице 'ВыполненныеРаботы' я выбираю текущую строку
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "2"
		И я перехожу к следующему реквизиту
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "2"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
		И в таблице 'ВыполненныеРаботы' я перехожу к строке:
			| "N" | "Описание выполненных работ" |
			| "2" | "Замена комплектующих"       |
		И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов'
		И в таблице 'ВыполненныеРаботы' я выбираю текущую строку
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "2"
		И я перехожу к следующему реквизиту
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "2"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
		И в таблице 'ВыполненныеРаботы' я перехожу к строке:
			| "N" | "Описание выполненных работ" |
			| "3" | "Ремонт оборудования"        |
		И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов'
		И в таблице 'ВыполненныеРаботы' я выбираю текущую строку
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "2"
		И я перехожу к следующему реквизиту
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "2"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
	* Проведение документа
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Обслуживание клиента * от * *" в течение 10 секунд
	* Закрытие документа Обслуживание клиентов выполненными работами специалиста Зайсанова
		Тогда открылось окно "Обслуживание клиентов"
		И в таблице 'Список' я перехожу к строке:
			| "Время начала работ (План)" | "Время окончания работ (План)" | "Дата"                | "Дата проведения работ" | "Договор"                      | "Клиент"            | "Номер"     | "Специалист"     | "Ссылка"                                                | "Статус заявки"              |
			| "09.00"                     | "15.00"                        | "24.09.2026 18:02:18" | "29.09.2026"            | "Обслуживание абонентов №1002" | "ООО ВетЗвероЦентр" | "000000015" | "Зайсанова З.И." | "Обслуживание клиента 000000015 от 24.09.2026 18:02:18" | "Ожидается выполнение работ" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Обслуживание клиента * от *"
	* Заполнение табличной части
		И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
		И в таблице 'ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВыполненныеРаботыПредоставленнаяУслуга'
		Тогда открылось окно "Номенклатура"
		И в таблице 'Список' я перехожу на один уровень вниз
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000008" | "Установка ПО" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Обслуживание клиента * от * *"
		И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов'
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "3"
		И я перехожу к следующему реквизиту
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "3"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
	* Проведение документа
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Обслуживание клиента * от * *" в течение 10 секунд
