#language: ru

@tree

Функционал: Проверка обработки Создание массовых актов на работоспособность

Как Бухгалтер я хочу
проверить возможность создания Массовых актов по обслуживанию клиентов
чтобы автоматизировать создание Реализаций товаров и услуг по выполненным работам   

Контекст:
	Дано я подключаю TestClient "Фирма IT" логин "Бухгалтер" пароль ""
	И я закрываю все окна клиентского приложения
	
Сценарий: Тестирование обработки Массового создания актов для Бухгалтера
	* Открытие обработки Массовое создание документов
		И В командном интерфейсе я выбираю "Обслуживание клиентов" "Mассовое создание актов"
		Тогда открылось окно "Mассовое создание актов"
	* Создание документов за август
		И я нажимаю на кнопку с именем 'ФормаСоздатьДокументы'
	* Создание документов за сентябрь
		И я нажимаю кнопку выбора у поля с именем 'Период'
		Тогда открылось окно "Выберите период"
		И в поле с именем 'DateBegin' я ввожу текст "01.09.2026"
		И в поле с именем 'DateEnd' я ввожу текст "30.09.2026"
		И я нажимаю на кнопку с именем 'Select'
		Тогда открылось окно "Mассовое создание актов"
		И я нажимаю на кнопку с именем 'ФормаСоздатьДокументы'
