#language: ru

@tree

Функционал: Анализ выставленных актов по документу Обслуживание клиентов

Как Бухгалтер я хочу
хочу узнать о клиентах, договорах и суммах, которые должны быть выставленны клиенту
чтобы контролировать задолженности и своевременно формировать акты оказанных услуг  

Контекст:
		Дано я подключаю TestClient "Фирма IT" логин "Бухгалтер" пароль ""
		И я закрываю все окна клиентского приложения

Сценарий: Формирование отчёта с данными по клиентам и договорам
	* Формирование отчета за август
		И В командном интерфейсе я выбираю "Обслуживание клиентов" "Анализ выставленных актов"
		Тогда открылось окно "Анализ выставленных актов"
		И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
		Тогда открылось окно "Выберите период"
		И я нажимаю на кнопку с именем 'Select'
		Тогда открылось окно "Анализ выставленных актов"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
	* Формирование отчета за сентябрь
		И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
		Тогда открылось окно "Выберите период"
		И я нажимаю на кнопку с именем 'Select'
		Тогда открылось окно "Анализ выставленных актов"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
