#language: ru

@tree

Функционал: Создание документов Обслуживание клиента

Как Менеджер по обслуживанию я хочу
создать документ Обслуживание клиента на разных специалистов 
чтобы проверить работоспособность  

Контекст:
	Дано я подключаю TestClient "Фирма IT" логин "МенеджерПО" пароль ""
	И я закрываю все окна клиентского приложения

Сценарий: Создание документа Обслуживание клиента для специалиста Иванов и Зайсанова на разных контрагентов, 29.09.2026 с 9.00 до 15.00
	* Создание документа Обслуживание клиенту для Иванова
		И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
		Тогда открылось окно "Обслуживание клиентов"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Обслуживание клиента (создание)"
	* Заполнение шапки документа
		И я нажимаю кнопку выбора у поля с именем 'Клиент'
		Тогда открылось окно "Контрагенты"
		И в таблице 'Список' я перехожу на один уровень вниз
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"                            |
			| "000000006" | "ООО Кусочек счастья для бездомной кошки" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Обслуживание клиента (создание) *"
		И в поле с именем 'ДатаПроведенияРабот' я ввожу текст "29.09.2026"
		И в поле с именем 'ВремяНачалаРабот' я ввожу текст "09.00"
		И я перехожу к следующему реквизиту
		И в поле с именем 'ВремяОкончанияРабот' я ввожу текст "15.00"
		И я нажимаю кнопку выбора у поля с именем 'Специалист'
		Тогда открылось окно "Сотрудники"
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000001" | "Иванов И.И."  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
	* Запись документа
		Тогда открылось окно "Обслуживание клиента (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
	* Создание документа Обслуживание клиента для Зайсановой
		И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
		Тогда открылось окно "Обслуживание клиентов"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
	* Заполнение шапки документа
		Тогда открылось окно "Обслуживание клиента (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Клиент'
		Тогда открылось окно "Контрагенты"
		И в таблице 'Список' я перехожу на один уровень вниз
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"      |
			| "000000004" | "ООО ВетЗвероЦентр" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Обслуживание клиента (создание) *"
		И в поле с именем 'ДатаПроведенияРабот' я ввожу текст "29.09.2026"
		И я перехожу к следующему реквизиту
		И в поле с именем 'ВремяНачалаРабот' я ввожу текст "09.00"
		И я перехожу к следующему реквизиту
		И в поле с именем 'ВремяОкончанияРабот' я ввожу текст "15.00"
		И я нажимаю кнопку выбора у поля с именем 'Специалист'
		Тогда открылось окно "Сотрудники"
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"   |
			| "000000006" | "Зайсанова З.И." |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
	* Запись документа
		Тогда открылось окно "Обслуживание клиента (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
	