#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ГрафикРабот) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Перед заполнением укажите график работ.", , "ГрафикРабот");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) 
		ИЛИ НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Корректно заполните период заполнения графика работ.", , "Период");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		"Обработка заполнения графика завершена.");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьГрафик(
		Период.ДатаНачала, 
		Период.ДатаОкончания, 
		ВыходныеДниПоДнямНедели, 
		ГрафикРабот);
	
КонецПроцедуры

#КонецОбласти