#Область ПрограммныйИнтерфейс

// Функция проверяет наличие существующего документа с данными,
// предлагаемыми к записи.
//
// Параметры:
//   ТекущийОбъект - ДокументОбъект - документ реализации.
//
// Возвращаемое значение:
//   ДокументСсылка, Неопределено - найденный документ или Неопределено.
//
Функция НайтиСуществующийДокументРеализацияСДаннымиТекущегоОбъекта(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &ДатаНачалаПериода
		|	И РеализацияТоваровУслуг.Дата <= &ДатаОкончанияПериода
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Ссылка <> &Ссылка
		|	И РеализацияТоваровУслуг.Договор = &Договор
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|	И РеализацияТоваровУслуг.Организация = &Организация
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = 
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И РеализацияТоваровУслугУслуги.Номенклатура В (&НоменклатураАбонентскаяПлата, &НоменклатураРаботыСпециалиста)";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("Договор", ТекущийОбъект.Договор); 
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект.Контрагент);
	Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка); 
	Запрос.УстановитьПараметр("НоменклатураАбонентскаяПлата", 
		Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить());
	Запрос.УстановитьПараметр("НоменклатураРаботыСпециалиста", 
		Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Проверка правильности заполнения документа РеализацияТоваровУслуг.
//
// Параметры:
//   Объект - ДокументОбъект - проверяемый документ.
//
// Возвращаемое значение:
//   Булево - Истина, если документ заполнен верно.
//
Функция ДокументРеализацииТоваровИУслугЗаполненВерно(Знач Объект) Экспорт
	
	// Проверить заполненность поля договор
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда	
		ТекстСообщения = "Ошибка. Не указан договор";
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения, Объект.Ссылка, "Объект.Договор", "Объект.Договор");
		Возврат Ложь;
	КонецЕсли;
	
	// Проверить вид договора
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВидДоговора") 
		<> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ТекстСообщения = "Должен быть договор абонентского обслуживания";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.Договор");
		Возврат Ложь;
		
	КонецЕсли;
	
	// Проверить действие договора
	ДатаНачалИДатаОкончанияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект.Договор, 
		"ВКМ_ДатаНачалаДействияДоговора,ВКМ_ДатаОкончанияДействияДоговора");
	
	Если ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаНачалаДействияДоговора > Объект.Дата 
		ИЛИ ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаОкончанияДействияДоговора < Объект.Дата Тогда
		
		ТекстСообщения = "Выбранный договор не действителен на дату документа.
			|Создание документа реализации товаров и услуг невозможно.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.Договор");
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДополнительныеЭлементыФормы(Форма) Экспорт
	
	// Дополнительная кнопка
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие = "ВКМ_ВыполнитьКомандуЗаполнить";
	КомандаЗаполнить.Заголовок = "Заполнить";
	
	КнопкаЗаполнить = Форма.Элементы.Добавить(
		"КнопкаСформироватьТаблицу", 
		Тип("КнопкаФормы"), 
		Форма.Элементы.ФормаКоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды = "Заполнить"; 
	
	// Для удобства перейти к закладке Услуги
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.ГруппаУслуги;
	
КонецПроцедуры

#КонецОбласти
